In [1]:
import numpy as np
import pandas as pd

In [3]:
df1 = pd.DataFrame({
    'A':['A0','A1','A2','A3'],
    'B' : ['B0','B1','B2','B3'],
})

df2 = pd.DataFrame({
    'C' : ['C0','C1','C2','C3'],
    'D':['D0','D1','D2','D3']
})

In [4]:
df1

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [5]:
df2

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

## Concatenate along rows (axis=0)

In [8]:
df_a0 = pd.concat([df1,df2],axis=0)

In [9]:
df_a0

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

## Concatenate along columns (axis=1)

In [10]:
df_a1 = pd.concat([df1,df2],axis=1)
df_a1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

## Axis 0 but columns being matched-up

In [11]:
df1.columns

Index(['A', 'B'], dtype='object')

In [12]:
df2.columns

Index(['C', 'D'], dtype='object')

In [13]:
df1.columns = df2.columns

In [14]:
df1.columns

Index(['C', 'D'], dtype='object')

In [15]:
df2.columns

Index(['C', 'D'], dtype='object')

In [16]:
pd.concat([df1,df2])

    C   D
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

## Merge

In [22]:
registrations = pd.DataFrame({
    'reg_id' : [1,2,3,4],
    'name' : ['Andrew','Bob','Claire','David']
})

logins = pd.DataFrame({
    'log_id' : [1,2,3,4],
    'name' : ['Xavier','Andrew','Yolanda','Bob']
})

### Inner Join

In [23]:
pd.merge(registrations,logins,how='inner',on='name')

   reg_id    name  log_id
0       1  Andrew       2
1       2     Bob       4

### Left Join

In [24]:
pd.merge(registrations,logins,how='left',on='name')

   reg_id    name  log_id
0       1  Andrew     2.0
1       2     Bob     4.0
2       3  Claire     NaN
3       4   David     NaN

### Right Join

In [25]:
pd.merge(registrations,logins,how='right',on='name')

   reg_id     name  log_id
0     NaN   Xavier       1
1     1.0   Andrew       2
2     NaN  Yolanda       3
3     2.0      Bob       4

### Outer

In [26]:
pd.merge(registrations,logins,how='outer',on='name')

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0      Bob     4.0
2     3.0   Claire     NaN
3     4.0    David     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     3.0

## Join on Index

In [27]:
registrations

   reg_id    name
0       1  Andrew
1       2     Bob
2       3  Claire
3       4   David

In [28]:
registrations = registrations.set_index('name')

In [29]:
registrations

        reg_id
name
Andrew       1
Bob          2
Claire       3
David        4

In [30]:
pd.merge(registrations,logins, left_index=True,right_on='name')

   reg_id  log_id    name
1       1       2  Andrew
3       2       4     Bob

In [33]:
pd.merge(logins, registrations,right_index=True,left_on='name')

   log_id    name  reg_id
1       2  Andrew       1
3       4     Bob       2

## Differing key column names

In [34]:
registrations = registrations.reset_index()

In [35]:
registrations

     name  reg_id
0  Andrew       1
1     Bob       2
2  Claire       3
3   David       4

In [36]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4      Bob

In [37]:
registrations.columns = ['reg_name','reg_id']

In [38]:
registrations

  reg_name  reg_id
0   Andrew       1
1      Bob       2
2   Claire       3
3    David       4

In [39]:
pd.merge(registrations,logins)

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [41]:
pd.merge(registrations,logins, left_on='reg_name',right_on='name').drop('reg_name',axis=1)

   reg_id  log_id    name
0       1       2  Andrew
1       2       4     Bob

## Multiple columns with same name

In [43]:
registrations.columns = ['name','id']

In [45]:
logins.columns = ['id','name']

In [46]:
registrations

     name  id
0  Andrew   1
1     Bob   2
2  Claire   3
3   David   4

In [47]:
logins

   id     name
0   1   Xavier
1   2   Andrew
2   3  Yolanda
3   4      Bob

In [48]:
pd.merge(registrations,logins,on='name')

     name  id_x  id_y
0  Andrew     1     2
1     Bob     2     4

In [49]:
pd.merge(registrations,logins,on='name', suffixes=('_reg','_log'))

     name  id_reg  id_log
0  Andrew       1       2
1     Bob       2       4